kapojko/DAPLink/source/hic_hal/stm32/stm32h723vg/example_cubemx/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SWDIO_OUT_Pin GPIO_PIN_2
#define SWDIO_OUT_GPIO_Port GPIOE
#define SWDIO_IN_Pin GPIO_PIN_3
#define SWDIO_IN_GPIO_Port GPIOE
#define SWCLK_OUT_Pin GPIO_PIN_5
#define SWCLK_OUT_GPIO_Port GPIOE
#define LED_CONNECTED_Pin GPIO_PIN_6
#define LED_CONNECTED_GPIO_Port GPIOA
#define LED_RUNNING_Pin GPIO_PIN_7
#define LED_RUNNING_GPIO_Port GPIOA
#define LED_EXTRA_Pin GPIO_PIN_0
#define LED_EXTRA_GPIO_Port GPIOB
#define LED_CDC_Pin GPIO_PIN_12
#define LED_CDC_GPIO_Port GPIOD
#define LED_MSC_Pin GPIO_PIN_13
#define LED_MSC_GPIO_Port GPIOD
#define LED_HID_Pin GPIO_PIN_14
#define LED_HID_GPIO_Port GPIOD
#define BTN_BOOT_Pin GPIO_PIN_8
#define BTN_BOOT_GPIO_Port GPIOB
#define BTN_BOOT_EXTI_IRQn EXTI9_5_IRQn
#define BTN_CONF_Pin GPIO_PIN_9
#define BTN_CONF_GPIO_Port GPIOB
#define BTN_CONF_EXTI_IRQn EXTI9_5_IRQn
#define POWER_EN_Pin GPIO_PIN_0
#define POWER_EN_GPIO_Port GPIOE

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
